Repository: AleksandrPidlozhevich/EEPRevitPlagin
Catalog: EEPRevitPlagin/SecondaryCommand/LangResources/Language.*.resx
Languages: be_by, ru_ru, uk_ua

# Architectural_PanelName
source: Arch
be_by: АР
ru_ru: АР
uk_ua: АР

source: Apply
be_by: Ужыць
ru_ru: Применить
uk_ua: Застосувати

source: Change plugin language
be_by: Змяніць мову плагіна
ru_ru: Изменить язык плагина
uk_ua: Змінити мову плагіна

# Family
source: Families
be_by: Cем'яў
ru_ru: Семейства
uk_ua: Родини

source: Font Change
be_by: Змена шрыфта
ru_ru: Изменение шрифта
uk_ua: Зміна шрифту

# Structural_PanelName
source: Structural
be_by: КР
ru_ru: КР
uk_ua: КР

source: Сhoose a font
be_by: Абярыце шрыфт
ru_ru: Выберите шрифт
uk_ua: Виберіть шрифт

source: Select Language :
be_by: Выбраць мову:
ru_ru: Выбрать язык:
uk_ua: Вибрати мову:

source: Lintels
be_by: Перамычкі
ru_ru: Перемычки
uk_ua: Перемички

# MEP_PanelName
source: MEP
be_by: ІАС
ru_ru: ИОС
uk_ua: ІОМ

source: Please restart Revit for the changes to take effect
be_by: Калі ласка, перазапусціце Revit, каб змены ўступілі ў сілу
ru_ru: Пожалуйста, перезапустите Revit, чтобы изменения вступили в силу
uk_ua: Будь ласка, перезапустіть Revit, щоб зміни набули чинності

source: Greeting
be_by: Прывітанне
ru_ru: Приветствие
uk_ua: Вітання

source: Finish height
be_by: Вышыня аздаблення
ru_ru: Высота отделки
uk_ua: Висота оздоблення

source: Room boundary
be_by: Мяжа памяшкання
ru_ru: Граница помещения
uk_ua: Кордон приміщення

source: Cancel
be_by: Скасаванне
ru_ru: Отмена
uk_ua: Скасувати

source: Base material
be_by: Матэрыял асновы
ru_ru: Материал основы
uk_ua: Матеріал основи

source: Finish type
be_by: Тып аздаблення
ru_ru: Тип отделки
uk_ua: Тип оздоблення

source: Wall finish properties
be_by: Ўласцівасці аздаблення сцен
ru_ru: Свойства отделки стен
uk_ua: Властивості оздоблення стін

source: Choose an option:
be_by: Абярыце опцыю:
ru_ru: Выберите опцию:
uk_ua: Виберіть опцію:

source: For the current file
be_by: Па бягучым файле
ru_ru: По текущему файлу
uk_ua: По поточному файлу

source: By linked file
be_by: Па звязаны файле
ru_ru: По связанному файлу
uk_ua: По зв'язаному файлу

source: Create wall finish
be_by: Стварэнне аздаблення
ru_ru: Создание отделки
uk_ua: Створення оздоблення

# Choose_room
source: Choose a room!
be_by: Абярыце памяшкання!
ru_ru: Выберите помещения!
uk_ua: Виберіть приміщення!

source: Building walls
be_by: Стварэнне сцен
ru_ru: Создание стен
uk_ua: Створення стін

source: Merging walls
be_by: Аб'яднанне сцен
ru_ru: Объединение стен
uk_ua: Об'єднання стін

source: Regret! Cutting openings in walls through the API appeared only in the 2021 version!
be_by: Шкадую! Выразанне праёмаў у сценах праз API з'явілася толькі ў 2021 версіі!
ru_ru: Сожалею! Вырезание проемов в стенах через API появилось только в 2021 версии!
uk_ua: Жаль! Вирізання отворів у стінах через API з'явилося лише у 2021 році!

# Select_a_linked_file
source: Please select a linked file!
be_by: Абярыце звязаны файл!
ru_ru: Выберите связанный файл!
uk_ua: Виберіть зв'язаний файл!

source: Linked file not found!
be_by: Звязаны файл не знойдзены!
ru_ru: Связанный файл не найден!
uk_ua: Зв'язаний файл не знайдено!

source: Cutting holes
be_by: Выразанне адтулін
ru_ru: Вырезание проемов
uk_ua: Вирізання отворів

# Something_wrong!WallFinishProperties
source: Something went wrong! Please click the \"Wall finish properties\" button and select an option!"
be_by: Нешта пайшло не так! Калі ласка, націсніце кнопку "Уласцівасці аздаблення сцен" і абярыце опцыю!"
ru_ru: Что-то пошло не так! Пожалуйста нажмите кнопку \"Свойства отделки стен\" и выберите опцию!"
uk_ua: Щось пішло не так! Будь ласка, натисніть кнопку \"Властивості оздоблення стін\" та виберіть опцію!"

# ListNumberingCommand_Url
source: \\The-dc\00.0 инициатива инжпроект\20 БИБЛИОТЕКА\BIM_Библиотека\Revit\Плагины\EEP\About\Нумерация листов.pdf
be_by: https://github.com/AleksandrPidlozhevich/EEP_Revit_Plagin
uk_ua: https://github.com/AleksandrPidlozhevich/EEP_Revit_Plagin

# ScheduleRowCounterCommand_Title
source: Reordering
be_by: Змена парадку
ru_ru: Перенумератор
uk_ua: Перевпорядкування

# RevitServerExportCommand_Tooltip
source: Export model from Revit Server
be_by: Экспарт мадэлі з Revit сервера
ru_ru: Экспорт модели из Revit сервера
uk_ua: Експорт моделі з сервера Revit

# RevitServerExportCommand_Title
source: Revit Server\nExport
be_by: Revit Server\nЭкспарт
ru_ru: Revit Server\nЭкспорт
uk_ua: Revit Server\nЕкспорт

# LanguageChangeCommand_Tooltip
source: LanguageChange
be_by: Змена мовы\nплагіна
ru_ru: Изменение языка\nплагина
uk_ua: Зміна мови\nплагіна

# LanguageChangeCommand_Title
source: LanguageChange
be_by: Змена мовы\nплагіна
ru_ru: Изменение языка\nплагина
uk_ua: Зміна мови\nплагіна

# FontChangingCommand_Tooltip
source: Changing the font in the project and annotations.
be_by: Змяненне шрыфта ў праекце і анатацыях.
ru_ru: Изменение шрифта в проекте и аннотациях.
uk_ua: Зміна шрифту у проекті та анотаціях.

# FontChangingCommand_Title
source: Change\nfont
be_by: Змена\nшрыфта
ru_ru: Изменить\nшрифт
uk_ua: Зміна\nшрифту

# DuctInsulationCheckCommand_Tooltip
source: Checking the insulation of ducts and fittings
be_by: Праверка ізаляцыі паветраводаў і фітынгаў
ru_ru: Проверка изоляции воздуховодов и фитингов
uk_ua: Перевірка ізоляції повітроводів та фітингів

# DuctInsulationCheckCommand_Title
source: Duct insulation\ncheck
be_by: Праверка ізаляцыі\паветраводаў
ru_ru: Проверка изоляции\nвоздуховодов
uk_ua: Перевірка ізоляції\nповітропроводів

# WallFinishCreatorCommand_Tooltip
source: Create wall finishes along room contours from a linked file
be_by: Стварэнне аздаблення ў выглядзе сцен па контуры памяшканняў з звязаны файла
ru_ru: Создание отделки в виде стен по контуру помещений из связанного файла
uk_ua: Створення оздоблення у вигляді стін по контуру приміщень із з'язаного файлу

# WallFinishCreatorCommand_Title
source: Wall finishing
be_by: Аздабленне сцен
ru_ru: Отделка стен
uk_ua: Оздоблення стін

# WallFinishCreatorPropertiesCommand_Tooltip
source: Selecting the option to create a finish from a linked file or from the current file
be_by: Выбар опцыі стварэння аздаблення па звязаным файле ці па бягучым файле
ru_ru: Выбор опции создания отделки по связанному файлу или по текущему файлу
uk_ua: Вибір варіанту створення обробки з пов'язаного файлу або з поточного файлу

# WallFinishCreatorPropertiesCommand_Title
source: Wall finish\nproperties
be_by: Уласцівасці\аздабленні сцен
ru_ru: Свойства\nотделки стен
uk_ua: Властивості\оздоблення стін

# InstallationDoorWindowLintelsCommand_Tooltip
source: Placement of jumpers over windows and doors
be_by: Размяшчэнне перамычак над вокнамі і дзвярамі
ru_ru: Размещение перемычек над окнами и дверями
uk_ua: Розміщення перемичок над вікнами та дверима

# InstallationDoorWindowLintelsCommand_Title
source: Placement\nlintels
be_by: Размяшчэнне\nперамычак
ru_ru: Размещение\nперемычек
uk_ua: Розміщення\nперемичок

# OffAnalyticsModelCommand_Title
source: Turn off\nanalytical model
be_by: Выкл.\nаналітычную мадэль
ru_ru: Вык.\nаналитическую\nмодель
uk_ua: Вимк.\nаналітичну модель

# OffAnalyticsModelCommand_Tooltip
source: Turn off analytical model
be_by: Выключыць аналітычную мадэль
ru_ru: Выключить аналитическую модель
uk_ua: Вимкнути аналітичну модель

# RevisionCloudsCommand_Title
source: Filling in\nrevisions сlouds
be_by: Запаўненне\nхмар рэвізій
ru_ru: Заполнение\nоблаков ревизий
uk_ua: Заповнення\nхмар ревізій

source: Choose folder
be_by: Шлях захавання
ru_ru: Путь сохранения
uk_ua: Шлях збереження

# ChangeTypeCopyPropertisCommand_Title
source: Witch\nbroom
be_by: Мятла\nведзьмы
ru_ru: Метла\nведьмы
uk_ua: Мітла\nвідьми

# SpecificationExportCommand_Title
source: Export specification\nfields
be_by: Экспарт палёў\nспецыфікацыі
ru_ru: Экспорт полей\nспецификации
uk_ua: Експорт полів\nспецифікації

source: Server IP
be_by: IP-адрас сервера
ru_ru: IP Сервера
uk_ua: IP-адреса сервера

source: Revit Version
be_by: Версія Revit
ru_ru: Версия Revit
uk_ua: Версія Revit

source: Project
be_by: Праект
ru_ru: Проект
uk_ua: Проект

source: Revit Server - Export Models
be_by: Revit Server - Выгрузка Мадэляў
ru_ru: Revit Server - Выгузка Моделей
uk_ua: Revit Server - Вивантаження моделей

# Navisworks_view_contains
source: The Navisworks view name contains
be_by: Імя віду Navisworks змяшчае
ru_ru: Имя вид Navisworks содержит
uk_ua: Ім'я виду Navisworks містить

# IFC_view_contains
source: The IFC view name contains
be_by: Імя віду IFC змяшчае
ru_ru: Имя вид IFC содержит
uk_ua: Ім'я виду IFC містить

source: Save as:
be_by: Захаваць як:
ru_ru: Сохранить как:
uk_ua: Зберегти як:

source: Сonnect to server
be_by: Падключыцца да сервера
ru_ru: Подключится к серверу
uk_ua: Підключиться до сервера

source: Export Selected Models
be_by: Выгрузка выбраных мадэляў
ru_ru: Выгрузка выбранных мдоелей
uk_ua: Вивантаження вибраних моделей

source: Exit
be_by: Закрыць
ru_ru: Закрыть
uk_ua: Закрити

# CheckModelChangesCommand_Tooltip
source: Check the linked models for any changes
be_by: Праверыць змены ў звязаным файла
ru_ru: Проверить изменения в связанном файла
uk_ua: Перевірити зміни у пов'язаному файлі

# CheckModelChangesCommand_Title
source: Check Models'\nChanges
be_by: Праверыць\nзмены\nу звязаным файле
ru_ru: Проверить\nизменения\nв связанном файле
uk_ua: Перевірити\nзміни\nу зв'язаному файлі

# AnalyzeSourceModelCommand_Tooltip
source: Save the state of the model
be_by: Запісаць стан мадэлі
ru_ru: Записать состояние модели
uk_ua: Записати стан моделі

# AnalyzeSourceModelCommand_Title
source: Save model\nstate
be_by: Запісаць стан\nмадэлі
ru_ru: Записать состояние\nмодели
uk_ua: Записати стан\nмоделі

# ModelCompareCommand_Tooltip
source: Compare this model to the source model
be_by: Перевірка змін у поточній моделі
ru_ru: Проверка изменений в текущей модели
uk_ua: Перевірка змін у поточній моделі

# ModelCompareCommand_Title
source: Compare two\nmodels
be_by: Параўноўваць\nдзве мадэлі
ru_ru: Сравнивать\nдве модели
uk_ua: Порівнювати\n дві моделі

# ListNumberingCommand_Tooltip
source: To extract Sheet Number and add it to the list
be_by: Перанумарацыя лістоў
ru_ru: Перенумерация листов
uk_ua: Перенумерація листів

# ListNumberingCommand_Title
source: Sheet\nrenumbering
be_by: Перанумарацыя\nлістоў
ru_ru: Перенумерация\nлистов
uk_ua: Перенумерація\nлистів

# ScheduleRowCounterCommand_Tooltip
source: Add row numbers to the schedule
be_by: Дадаць нумары радкоў у спецыфікацыі
ru_ru: Добавить номера строк в спецификации
uk_ua: Додати номери рядків у специфікації

# FindOverrideViewElementsCommand_Tooltip
source: Find override graphics elements in current view
be_by: Пошук элементаў з перавызначанай графікай
ru_ru: Поиск элементов с переопределенной графикой
uk_ua: Пошук елементів із перевизначеною графікою

# FindOverrideViewElementsCommand_Title
source: Override Graphics\nElements Find
be_by: Пераазначэнне графікі
ru_ru: Переопред.\nграфика
uk_ua: Перевизначення графіки

source: Add Models manually
be_by: Дадаць мадэлі ўручную
ru_ru: Добавить модели вручную
uk_ua: Додати моделі вручну

source: Combine all .nwc to one .nwd file
be_by: Аб'яднаць усе .nwc у адзін файл .nwd
ru_ru: Объединить все .nwc в один файл .nwd
uk_ua: Об'єднати всі .nwc в ​​один файл .nwd

# PropertiesCopyCommand_Title
source: Magic\nwand
be_by: Чароўная палачка
ru_ru: Волшебная\nпалочка
uk_ua: Чарівна паличка

# PropertiesCopyCommand_Tooltip
source: Copying element parameters
be_by: Капіраванне параметраў элемента
ru_ru: Копирование параметров элемента
uk_ua: Копіювання параметрів елемента

# Select_the_ite_from_which_to_copy_properties
source: Select the item from which to copy properties
be_by: Абярыце элемент, з якога трэба скапіяваць уласцівасці
ru_ru: Выберите элемент, с которого нужно скопировать свойства
uk_ua: Виберіть елемент, з якого потрібно скопіювати властивості

# Error_messages
source: Something didn’t work out. Keep calm and order!
be_by: Нешта не атрымалася. Захоўвайце спакой і парадак!
ru_ru: Что-то не получилось. Сохраняйте спокойствие и порядок!
uk_ua: Щось не вийшло. Зберігайте спокій та порядок!

source: Property copying
be_by: Копіювання властивостей
ru_ru: Копирование свойств
uk_ua: Капіраванне ўласцівасцей

# Selected_item_not_retrieved
source: The selected item could not be retrieved.
be_by: Не атрымалася атрымаць абраны элемент.
ru_ru: Не удалось получить выбранный элемент.
uk_ua: Не вдалося отримати вибраний елемент.

# Select_copy_properties_or_Esc
source: Select an item to copy properties to or click Esc to complete.
be_by: Абярыце элемент для капіявання уласцівасцяў або націсніце Esc для завяршэння.
ru_ru: Выберите элемент для копирования свойств или нажмите Esc для завершения.
uk_ua: Виберіть елемент для копіювання властивостей або натисніть Esc для завершення.

# ChangeTypeCopyPropertisCommand_Tooltip
source: Changes item type and copies all properties
be_by: Змяняе тып элемента і капіюе ўсе параметры
ru_ru: Изменяет тип элемента и копирует все параметры
uk_ua: Змінює тип елемента та копіює всі параметри

# RoomBoundaryLinesCommand_Title
source: walls of the room
be_by: Даўжыня сцены памяшкання
ru_ru: Длинна/nстены помещения
uk_ua: Довжина/стіни приміщення

# OffAnalyticsModelGroupCommand_Title
source: Turn off model analytics group
be_by: Выключыць аналітыку мадэль групы
ru_ru: Выключить аналитику модель группы
uk_ua: Вимкнути аналітику модель групи

# OffAnalyticsModelGroupCommand_Tooltip
source: Turn off model analytics group
be_by: Выключыць аналітыку мадэль групы
ru_ru: Выключить аналитику модель группы
uk_ua: Вимкнути аналітику модель групи

# RevisionCloudsCommand_Tooltip
source: Filling in revisions сlouds
ru_ru: Заполнение облаков ревизий
